app/Controllers/Dashboard.php

SELECT *
FROM `found_items`
WHERE `user_id` = '6'
ORDER BY `date_reported` DESC
---

            $data = [
                'user' => $user,
                'myItems' => $foundItemModel->where('user_id', $user['id'])
                                           ->orderBy('date_reported', 'DESC')
                                           ->findAll()