app/Controllers/Timeline.php

SELECT `found_items`.*
FROM `found_items`
LEFT JOIN `claimed_items` ON `claimed_items`.`item_id` = `found_items`.`id` AND `claimed_items`.`status` = "approved"
WHERE `found_items`.`status` = 'approved'
AND `claimed_items`.`id` IS NULL
ORDER BY `found_items`.`date_reported` DESC
---
    public function index()
    {
        $session = session();
        $user = $session->get('user'); // Check if user is logged in

        $foundItemModel = new FoundItemModel();
        $claimedItemModel = new ClaimedItemModel();

        // Get only approved items for public timeline (as per system specification)
        // Exclude items that have been successfully claimed (approved claims)
        $approvedItems = $foundItemModel->select('found_items.*')
                                       ->join('claimed_items', 'claimed_items.item_id = found_items.id AND claimed_items.status = "approved"', 'left')
                                       ->where('found_items.status', 'approved')
                                       ->where('claimed_items.id IS NULL') // Only items without approved claims
                                       ->orderBy('found_items.date_reported', 'DESC')
                                       ->findAll();