app/Models/ClaimedItemModel.php

    public function getClaimedItemsWithDetails()
    {
        return $this->select('claimed_items.*, found_items.item_name, found_items.description, found_items.image, found_items.founder_name, found_items.contact_number, found_items.location, users.username as verified_by_name')
                    ->join('found_items', 'found_items.id = claimed_items.item_id', 'left')
                    ->join('users', 'users.id = claimed_items.verified_by', 'left')
                    ->where('claimed_items.status', 'approved')
                    ->orderBy('claimed_items.date_claimed', 'DESC')
                    ->findAll();
---
SELECT `claimed_items`.*, `found_items`.`item_name`, `found_items`.`description`, `found_items`.`image`, `found_items`.`founder_name`, `found_items`.`contact_number`, `found_items`.`location`, `users`.`username` as `verified_by_name`
FROM `claimed_items`
LEFT JOIN `found_items` ON `found_items`.`id` = `claimed_items`.`item_id`
LEFT JOIN `users` ON `users`.`id` = `claimed_items`.`verified_by`
WHERE `claimed_items`.`status` = 'approved'
ORDER BY `claimed_items`.`date_claimed` DESC

    public function getPendingClaimsWithDetails()
    {
        return $this->select('claimed_items.*, found_items.item_name, found_items.description, found_items.image, found_items.founder_name, found_items.contact_number, found_items.location')
                    ->join('found_items', 'found_items.id = claimed_items.item_id')
                    ->where('claimed_items.status', 'pending')
                    ->orderBy('claimed_items.date_claimed', 'DESC')
                    ->findAll();
---
SELECT `claimed_items`.*, `found_items`.`item_name`, `found_items`.`description`, `found_items`.`image`, `found_items`.`founder_name`, `found_items`.`contact_number`, `found_items`.`location`
FROM `claimed_items`
JOIN `found_items` ON `found_items`.`id` = `claimed_items`.`item_id`
WHERE `claimed_items`.`status` = 'pending'
ORDER BY `claimed_items`.`date_claimed` DESC