app/Models/FoundItemModel.php

    public function getFoundItemsWithUser($status = null)
    {
        $builder = $this->select('found_items.*, users.username, users.email')
                        ->join('users', 'users.id = found_items.user_id', 'left');

        if ($status !== null) {
            $builder->where('found_items.status', $status);
        }

        return $builder->orderBy('found_items.date_reported', 'DESC')->findAll();
---
SELECT `found_items`.*, `users`.`username`, `users`.`email`
FROM `found_items`
LEFT JOIN `users` ON `users`.`id` = `found_items`.`user_id`
WHERE `found_items`.`status` = 'pending'
ORDER BY `found_items`.`date_reported` DESC

    public function getStatistics()
    {
        return [
            'pending' => $this->where('status', 'pending')->countAllResults(),
            'approved' => $this->where('status', 'approved')->countAllResults(),
            'claimed' => $this->where('status', 'claimed')->countAllResults(),
            'total' => $this->countAllResults(false)
---
SELECT COUNT(*) AS `numrows`
FROM `found_items`
WHERE `status` = 'approved'
SELECT COUNT(*) AS `numrows`
FROM `found_items`
WHERE `status` = 'claimed'
SELECT COUNT(*) AS `numrows`
FROM `found_items`